tutorials/coupled/conjugateHeatFoam/conjugateCavity/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p_rgh
    {
        solver           PCG;
        preconditioner   DIC;

        minIter          0;
        maxIter          1000;
        tolerance        1e-25;
        relTol           0.01;
    };

    p_rghFinal
    {
        solver           PCG;
        preconditioner   DIC;

        minIter          0;
        maxIter          1000;
        tolerance        1e-25;
        relTol           0;
    };

    U
    {
        solver           PBiCG;
        preconditioner   DILU;

        minIter          1;
        maxIter          1000;
        tolerance        1e-25;
        relTol           0.01;
    };

    T+T
    {
        solver           BiCG;
        preconditioner   Cholesky;

        minIter          0;
        maxIter          1000;
        tolerance        1e-25;
        relTol           0.1;
    };

    G
    {
        solver           PCG;
        preconditioner   DIC;

        minIter          1;
        maxIter          1000;
        tolerance        1e-25;
        relTol           0.1;
    };

    epsilon
    {
        solver           PBiCG;
        preconditioner   DILU;

        minIter          1;
        maxIter          100;
        tolerance        1e-25;
        relTol           0.01;
    };

    k
    {
        solver           PBiCG;
        preconditioner   DILU;

        minIter          1;
        maxIter          100;
        tolerance        1e-25;
        relTol           0.01;
    };
}

PISO
{
    nCorrectors         2;
    nNonOrthogonalCorrectors 0;
    p_rghRefCell        0;
    p_rghRefValue       0;
}

relaxationFactors
{
}

// ************************************************************************* //
